codeigniter4/app/Controllers/News.php

    public function create(){

        helper('form');

        $data = $this->request->getPost(['title', 'body']);

        if(!$this->validateData($data, [
            'title' => 'required|max_length[255]|min_length[10]',
            'body' => 'required|max_length[1000]|min_length[10]'
        ])){
            //A não passou na validação, portanto, mostra o formulário outra vez
            return $this->new();
        }

        //Passou na validação, portanto, insere os dados no banco
        $model = model(NewsModel::class);
        $post = $this->validator->getValidated();

        $model->save([
            'title' => $post['title'],
            'slug' => url_title($post['title'], '-', true),
            'body' => $post['body']
        ]);
---
INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('Novo título', 'novo-título', '  Este é o conteúdo da nova notícia a ser publicada no site.')