codeigniter4/app/Models/NewsModel.php

    public function getNews($slug = false){

        if($slug === false){
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `slug` = 'elvis-sighted'
 LIMIT 1

    public function getById($id){
        return $this->where(['Id' => $id])->first();
---
SELECT *
FROM `news`
WHERE `Id` = '5'
 LIMIT 1